{
    "id": "https://mastra.ai/docs/community/licensing",
    "title": "Licensing",
    "url": "https://mastra.ai/docs/community/licensing",
    "author": "",
    "text": "License \n Elastic License 2.0 (ELv2) \n Mastra is licensed under the Elastic License 2.0 (ELv2), a modern license designed to balance open-source principles with sustainable business practices. \n What is Elastic License 2.0? \n The Elastic License 2.0 is a source-available license that grants users broad rights to use, modify, and distribute the software while including specific limitations to protect the project’s sustainability. It allows: \n \n Free use for most purposes \n Viewing, modifying, and redistributing the source code \n Creating and distributing derivative works \n Commercial use within your organization \n \n The primary limitation is that you cannot provide Mastra as a hosted or managed service that offers users access to the substantial functionality of the software. \n Why We Chose Elastic License 2.0 \n We selected the Elastic License 2.0 for several important reasons: \n \n \n Sustainability: It enables us to maintain a healthy balance between openness and the ability to sustain long-term development. \n \n \n Innovation Protection: It ensures we can continue investing in innovation without concerns about our work being repackaged as competing services. \n \n \n Community Focus: It maintains the spirit of open source by allowing users to view, modify, and learn from our code while protecting our ability to support the community. \n \n \n Business Clarity: It provides clear guidelines for how Mastra can be used in commercial contexts. \n \n \n Building Your Business with Mastra \n Despite the licensing restrictions, there are numerous ways to build successful businesses using Mastra: \n Allowed Business Models \n \n Building Applications: Create and sell applications built with Mastra \n Offering Consulting Services: Provide expertise, implementation, and customization services \n Developing Custom Solutions: Build bespoke AI solutions for clients using Mastra \n Creating Add-ons and Extensions: Develop and sell complementary tools that extend Mastra’s functionality \n Training and Education: Offer courses and educational materials about using Mastra effectively \n \n Examples of Compliant Usage \n \n A company builds an AI-powered customer service application using Mastra and sells it to clients \n A consulting firm offers implementation and customization services for Mastra \n A developer creates specialized agents and tools with Mastra and licenses them to other businesses \n A startup builds a vertical-specific solution (e.g., healthcare AI assistant) powered by Mastra \n \n What to Avoid \n The main restriction is that you cannot offer Mastra itself as a hosted service where users access its core functionality. This means: \n \n Don’t create a SaaS platform that is essentially Mastra with minimal modifications \n Don’t offer a managed Mastra service where customers are primarily paying to use Mastra’s features \n \n Questions About Licensing? \n If you have specific questions about how the Elastic License 2.0 applies to your use case, please contact us  on Discord for clarification. We’re committed to supporting legitimate business use cases while protecting the sustainability of the project. Overview Discord",
    "image": "https://mastra.ai/api/og/docs?title=Licensing&description=Mastra%20License",
    "favicon": "https://mastra.ai/favicon.ico",
    "extras": {
        "links": [
            "https://mastra.ai/docs/community/licensing",
            "https://mastra.ai/",
            "https://mastra.ai/docs",
            "https://mastra.ai/examples"
        ]
    }
}