{
    "id": "https://mastra.ai/docs/evals/overview",
    "title": "Overview",
    "url": "https://mastra.ai/docs/evals/overview",
    "publishedDate": "",
    "author": "",
    "text": "Testing your agents with evals \n While traditional software tests have clear pass/fail conditions, AI outputs are non-deterministic — they can vary with the same input. Evals help bridge this gap by providing quantifiable metrics for measuring agent quality. \n Evals are automated tests that evaluate Agents outputs using model-graded, rule-based, and statistical methods. Each eval returns a normalized score between 0-1 that can be logged and compared. Evals can be customized with your own prompts and scoring functions. \n Evals can be run in the cloud, capturing real-time results. But evals can also be part of your CI/CD pipeline, allowing you to test and monitor your agents over time. \n Types of Evals \n There are different kinds of evals, each serving a specific purpose. Here are some common types: \n \n Textual Evals: Evaluate accuracy, reliability, and context understanding of agent responses \n Classification Evals: Measure accuracy in categorizing data based on predefined categories \n Tool Usage Evals: Assess how effectively an agent uses external tools or APIs \n Prompt Engineering Evals: Explore impact of different instructions and input formats \n \n Getting Started \n Evals need to be added to an agent. Here’s an example using the summarization, content similarity, and tone consistency metrics: \n src/mastra/agents/index.ts import { Agent } from \" @mastra/core/agent \"; \n import { openai } from \" @ai-sdk/openai \"; \n import { SummarizationMetric } from \" @mastra/evals/llm \"; \n import { \n ContentSimilarityMetric, \n ToneConsistencyMetric, \n} from \" @mastra/evals/nlp \"; \n \n const model = openai ( \" gpt-4o \"); \n \n export const myAgent = new Agent ({ \n name: \" ContentWriter \", \n instructions: \" You are a content writer that creates accurate summaries \", \n model, \n evals: { \n summarization: new SummarizationMetric (model), \n contentSimilarity: new ContentSimilarityMetric (), \n tone: new ToneConsistencyMetric (), \n }, \n}); \n You can view eval results in the Mastra dashboard when using mastra dev. \n Beyond Automated Testing \n While automated evals are valuable, high-performing AI teams often combine them with: \n \n A/B Testing: Compare different versions with real users \n Human Review: Regular review of production data and traces \n Continuous Monitoring: Track eval metrics over time to detect regressions \n \n Understanding Eval Results \n Each eval metric measures a specific aspect of your agent’s output. Here’s how to interpret and improve your results: \n Understanding Scores \n For any metric: \n \n Check the metric documentation to understand the scoring process \n Look for patterns in when scores change \n Compare scores across different inputs and contexts \n Track changes over time to spot trends \n \n Improving Results \n When scores aren’t meeting your targets: \n \n Check your instructions - Are they clear? Try making them more specific \n Look at your context - Is it giving the agent what it needs? \n Simplify your prompts - Break complex tasks into smaller steps \n Add guardrails - Include specific rules for tricky cases \n \n Maintaining Quality \n Once you’re hitting your targets: \n \n Monitor stability - Do scores remain consistent? \n Document what works - Keep notes on successful approaches \n Test edge cases - Add examples that cover unusual scenarios \n Fine-tune - Look for ways to improve efficiency \n \n See Textual Evals for more info on what evals can do. \n For more info on how to create your own evals, see the Custom Evals guide. \n For running evals in your CI pipeline, see the Running in CI guide. Tracing Textual Evals",
    "image": "https://mastra.ai/api/og/docs?title=Overview&description=Understanding%20how%20to%20evaluate%20and%20measure%20AI%20agent%20quality%20using%20Mastra%20evals.",
    "favicon": "https://mastra.ai/favicon.ico",
    "extras": {
        "links": [
            "https://mastra.ai/en/docs/evals/overview",
            "https://mastra.ai/",
            "https://mastra.ai/docs",
            "https://mastra.ai/examples"
        ]
    }
}